# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'composer' # PHP dependency manager
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'kubectl'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'podman'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'stripe'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'yq'
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
brew 'yarn'


# Apps
# cask 'aerial'
cask 'caffeine'
cask 'discord'
cask 'google-chrome'
cask 'gpg-suite'
cask 'iterm2'
cask 'podman-desktop'
cask 'rectangle'
cask 'steam'
cask 'tableplus'
cask 'the-unarchiver'
# cask 'tinkerwell'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Fonts
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-3'
cask 'font-source-serif-4'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825